## Plans :heavy_multiplication_x:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/85076ab5-7e74-4fb0-9732-e6acdfb109b7).


Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: run
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/install_pkgs.sh`
```

```
**Step**: run
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/setup_akash.sh`
```

```
**Step**: env
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/akash_providers.sh`
```
["akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"]

```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>


## Dir: layers/core | :heavy_multiplication_x:
**Dir**: layers/core
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:
```

```
**Step**: env
**Success**: :thumbsup:
**Command**: `bash -c set -e
set -u
source "$@" > /tmp/tmpsk52cfeb 2>&1
env -0 bash /github/workspace/scripts/s3_backend.sh`
```

```
**Step**: init
**Success**: :thumbsup:
**Command**: `tofu init -backend-config=backend.hcl -migrate-state`
```
#=#=#                                                                         ##O#-#                                                                                                                                                   0.0%##############################                                            41.9%############################################################              84.0%######################################################################## 100.0%

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for etcd...
- etcd in .terraform/modules/etcd/modules/coordination/etcd
- etcd.etcd_deployment in .terraform/modules/etcd/modules/compute/akash
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for mysql...
- mysql in .terraform/modules/mysql/modules/db/mysql
- mysql.mysql_deployment in .terraform/modules/mysql/modules/compute/akash
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for renterd...
- renterd in .terraform/modules/renterd/modules/compute/renterd
- renterd.renterd_deployment in .terraform/modules/renterd/modules/compute/akash

Initializing provider plugins...
- Finding registry.terraform.io/lumeweb/akash versions matching "0.1.1"...
- Finding latest version of hashicorp/null...
- Finding cloudflare/cloudflare versions matching "5.0.0-alpha1"...
- Installing registry.terraform.io/lumeweb/akash v0.1.1...
- Installed registry.terraform.io/lumeweb/akash v0.1.1 (signed, key ID 3092C291174CD877)
- Installing hashicorp/null v3.2.3...
- Installed hashicorp/null v3.2.3 (signed, key ID 0C0AF313E5FD9F80)
- Installing cloudflare/cloudflare v5.0.0-alpha1...
- Installed cloudflare/cloudflare v5.0.0-alpha1 (signed, key ID C76001609EE3B136)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpogz3x0j2/plan`
```
module.etcd.module.etcd_deployment.akash_deployment.service: Refreshing state... [id=19203803:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql.module.mysql_deployment.akash_deployment.service: Refreshing state... [id=19203802:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + renterd_endpoint    = "renterd.test-node.testing.pinner.xyz"
  + renterd_s3_endpoint = "s3.renterd.test-node.testing.pinner.xyz"
  + service_states      = {
      + etcd    = "active"
      + mysql   = "19203802:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      + renterd = (known after apply)
    }
╷
│ Error: Duplicate object key
│ 
│   on .terraform/modules/renterd/modules/compute/akash/outputs.tf line 20, in locals:
│   18:   exposed_ports = {
│   19:     for expose in coalesce(var.service.expose, []) :
│   20:     try(coalesce(expose.as, expose.port), expose.port) => {
│   21:       is_http = contains([80, 443], try(coalesce(expose.as, expose.port), expose.port))
│   22:       accept = coalesce(expose.accept, [])
│   23:     }
│   24:   }
│     ├────────────────
│     │ expose.as is 80
│     │ expose.port is 80
│ 
│ Two different items produced the key "80" in this 'for' expression. If
│ duplicates are expected, use the ellipsis (...) after the value expression
│ to enable grouping by key.
╵

```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
